#include "stdafx.h"
/*
0 = 未知
1 = 中国
2 = 中国-台湾
3 = 中国-福建
4 = 中国-云南
5 = 中国-贵州
6 = 中国-湖南
7 = 中国-湖北
8 = 中国-河南
9 = 中国-河北
10 = 中国-广东
11 = 中国-广西
12 = 中国-海南
13 = 中国-安徽
14 = 中国-浙江
15 = 中国-江西
16 = 中国-西藏
17 = 中国-新疆
18 = 中国-北京
19 = 中国-香港
20 = 中国-陕西
21 = 中国-四川
22 = 中国-吉林
23 = 中国-辽宁
24 = 中国-山东
25 = 中国-山西
26 = 中国-上海
27 = 中国-江苏
28 = 中国-甘肃
29 = 中国-青海
30 = 中国-黑龙江
31 = 中国-内蒙古
32 = 朝鲜
33 = 蒙古
34 = 伊朗
35 = 沙特阿拉伯
36 = 缅甸
37 = 越南
38 = 韩国
39 = 日本
40 = 日本-琉球群岛
41 = 印度
42 = 印度-锡金
43 = 尼泊尔
44 = 斯里兰卡
45 = 泰国
46 = 菲律宾
47 = 马来西亚
48 = 英国
49 = 老挝
50 = 新加坡
51 = 克什米尔地区
52 = 印度尼西亚
53 = 西班牙
54 = 埃及
55 = 密克罗尼西亚
56 = 法国
57 = 高加索地区
58 = 西伯利亚地区
59 = 西伯利亚东南部
60 = 澳大利亚
61 = 新西兰
62 = 美国-阿拉斯加
63 = 美国-夏威夷
64 = 美国
65 = 西印度群岛
66 = 也门
67 = 不丹
68 = 巴基斯坦
69 = 孟加拉
70 = 东亚
71 = 俄罗斯
72 = 柬埔寨
73 = 阿富汗
74 = 阿拉伯半岛
75 = 哈萨克斯坦
76 = 新几内亚
77 = 北美
78 = 中亚
79 = 亚洲
80 = 欧洲
81 = 非洲
82 = 地中海地区
*/
unsigned int DiscoverMapEnumTotal=83;
char DiscoverMapEnum[][64]=
{
	"未知",
		"中国",
		"中国-台湾",
		"中国-福建",
		"中国-云南",
		"中国-贵州",
		"中国-湖南",
		"中国-湖北",
		"中国-河南",
		"中国-河北",
		"中国-广东",
		"中国-广西",
		"中国-海南",
		"中国-安徽",
		"中国-浙江",
		"中国-江西",
		"中国-西藏",
		"中国-新疆",
		"中国-北京",
		"中国-香港",
		"中国-陕西",
		"中国-四川",
		"中国-吉林",
		"中国-辽宁",
		"中国-山东",
		"中国-山西",
		"中国-上海",
		"中国-江苏",
		"中国-甘肃",
		"中国-青海",
		"中国-黑龙江",
		"中国-内蒙古",
		"朝鲜",
		"蒙古",
		"伊朗",
		"沙特阿拉伯",
		"缅甸",
		"越南",
		"韩国",
		"日本",
		"日本-琉球群岛",
		"印度",
		"印度-锡金",
		"尼泊尔",
		"斯里兰卡",
		"泰国",
		"菲律宾",
		"马来西亚",
		"英国",
		"老挝",
		"新加坡",
		"克什米尔地区",
		"印度尼西亚",
		"西班牙",
		"埃及",
		"密克罗尼西亚",
		"法国",
		"高加索地区",
		"西伯利亚地区",
		"西伯利亚东南部",
		"澳大利亚",
		"新西兰",
		"美国-阿拉斯加",
		"美国-夏威夷",
		"美国",
		"西印度群岛",
		"也门",
		"不丹",
		"巴基斯坦",
		"孟加拉",
		"东亚",
		"俄罗斯",
		"柬埔寨",
		"阿富汗",
		"阿拉伯半岛",
		"哈萨克斯坦",
		"新几内亚",
		"北美",
		"中亚",
		"亚洲",
		"欧洲",
		"非洲",
		"地中海地区"
};